#! /usr/bin/env python
# -*- coding: utf-8 -*-

"""
明治の板チョコもどきを出力するプログラムです。そのプログラム自身が板チョコ。(笑)
"""

__author__ = "AOKI Atsushi"
__version__ = "1.0.3"
__date__ = "2022/11/28"

s='''a=".";b="#";p=print;p(b*80);p(b*80);p(b*3+a*74+b*3);p(b*3+a*49+b*2+a*6+b*4+
a*4+b*4+a*5+b*3);p(b*3+a*47+b*6+a*2+b*6+a*4+b*4+a*5+b*3);p(b*3+a*49+b*2+a*6+b*2+
a*6                                                                          +b*
2+a                                                 *7      +b*3    );p(     b*3
+a*                                               5+b*2+  a*4+b*    6+a*     2+b
*6+                                                 a*      8+      b*       8+a
*33     +b    *3);p(  b*3+a*        5+b*22+a                                 *4+
b*6     +a*2+b*6+a*2+b*6+a*2+b    *6+a*4  +b*4+a  *5+b*3  );p(b*    3+a*     5+b
*6+     a*2+b*  6+a*2+  b*6+a*  2+b*6+      a*6+  b*4+a*  2+b*6+    a*2+     b*6
+a*     4+b*4+  a*5+b*    3);p  (b*3+a*5+b*6+a*2  +b*6+a  *4+b*4    +a*2     +b*
16+     a*2+b*  6+a*2+    b*6+  a*4+b*            4+a*5+  b*3);p    (b*3     +a*
5+b     *6+a*2  +b*6+a    *4+b    *4+a*2+b*6+a*1  2+b*6+  a*2+b*    6+a*     4+b
*4+     a*5+    b*3);p    (b*3      +a*5+b*6      +a*2+b  *6+a*4    +b*4     +a*
4+b                                                       *14+a*             2+b
*6+                                                   a*2+b*6+               a*4
+b*                                                                          4+a
*5+b*3);p(b*3+a*5+b*4+a*4+b*6+a*4+b*4+a*6+b*8+a*6+b*6+a*2+b*6+a*4+b*4+a*5+b*3);p
(b*3+a*55+b*6+a*13+b*3);p(b*3+a*51+b*8+a*15+b*3);p(b*3+a*74+b*3);p(b*80);p(b*80)

;p(end="");p(end="");p(end="");p(end="");p(end="");''';exec(''.join(s.split()));

# このプログラムは2022年12月17日09時10分12秒にプログラムによって生成されました。
# このプログラムを生成するプログラムを作成してください。おきばりやしとくれやす！
